app/controllers/pistons_controller.rb

  def index
    @engine_makers = Piston.distinct.pluck(:engine_maker)
---
SELECT DISTINCT "pistons"."engine_maker" FROM "pistons"

  def show
    @value = params[:value]
    @records = Piston.where(engine_maker: @value)
---
SELECT "pistons".* FROM "pistons" WHERE "pistons"."engine_maker" = ?  [["engine_maker", "DEUTZ"]]

    def show_details
      @record = Piston.find(params[:record_id])
---
SELECT "pistons".* FROM "pistons" WHERE "pistons"."id" = ? LIMIT ?  [["id", 153], ["LIMIT", 1]]